calander/crm/front/app/Http/Controllers/Admin/ProductsController.php

    public function getItemForOrder($id)
    {
        \Session::put('url',\Request::getRequestUri());
        $id = decrypt($id);
        $product = $this->products->getById($id);
        if (is_null($product)) {
            throw new ResourceNotFoundException('Product not Found');
        }
        $multi_photo= ProductImage::where('product_id',$id)->get();

        $reviews = Review::where('productId', $id)->get();
---
select * from `product_image` where `product_id` = '39'
select * from `review` where `productId` = '39'