calander/crm/front/app/helpers.php

select * from `products` where `id` != '0' and `web_shop_price` != '0' and `deleted_at` is null and `products`.`deleted_at` is null order by `name` asc limit 6 offset 0
select count(*) as aggregate from `products` where `id` != '0' and `web_shop_price` != '0' and `deleted_at` is null and `products`.`deleted_at` is null
---
function postFooter(){


        $productFooter = App\Modules\Products\Product::where('id','!=',0)->where('web_shop_price','!=',0)->where('deleted_at',null)->orderBy('name','asc')->paginate(6);

select * from `currencies` where `id` = '2' limit 1
---
    function euro(){


        $eurConvert = App\Modules\Currencies\Currency::where('id','=',2)->first();

select * from `website_info` where `id` = '1' limit 1
---
    function email(){
        $email1 =  DB::table('website_info')->where('id',1)->first();

select * from `website_info` where `id` = '2' limit 1
---
    function phone(){
        $phone =  DB::table('website_info')->where('id',2)->first();

select * from `website_info` where `id` = '3' limit 1
---
    function facebook(){
        $facebook=  DB::table('website_info')->where('id',3)->first();

select * from `website_info` where `id` = '4' limit 1
---
    function twiter(){
        $twiter=  DB::table('website_info')->where('id',4)->first();

select * from `website_info` where `id` = '5' limit 1
---
    function google(){
        $google=  DB::table('website_info')->where('id',5)->first();

select * from `website_info` where `id` = '6' limit 1
---
    function insta(){
        $instta=  DB::table('website_info')->where('id',6)->first();

select * from `website_info` where `id` = '7' limit 1
---
    function address(){
        $address=  DB::table('website_info')->where('id',7)->first();