calander/crm/front/app/Http/Controllers/FrontController.php

select * from `users` where `email` = 'yyyyy@yopmail.com'
insert into `news_letter` (`email`, `is_client`, `subscription_type`, `updated_at`, `created_at`) values ('yyyyy@yopmail.com', '0', '1', '2020-06-24 11:16:12', '2020-06-24 11:16:12')
---
    public function newsLetter(Request $request){
        $all= $request->all();
        //$data1=['email'=>'rahul@yopmail.com'];
        // return view('emails.contact.newsletter',compact('data1', $data1));die;
        $user= User::where('email',$all['email'])->get();
        $check= 0;
        foreach ($user as $key => $value) {
           $check= 1;
        }
        if($all['checkbox']==1){
            $CheckNews= Newsletter::where('email',$all['email'])/*->where('subscription_type',1)*/->first();
            if($CheckNews->subscription_type==1){
                echo 1;
            }elseif($CheckNews->subscription_type==2){
                $CheckNews->subscription_type= 1;
                $CheckNews->update();
                echo 0;
            }else{

                $news= new Newsletter();
                $news->email= $all['email'];
                $news->is_client= $check;
                $news->subscription_type= 1;
                $news->save();