calander/crm/admin/app/Http/Controllers/Admin/UsersController.php

        public function listCoupon(){
            $coupons= Coupon::orderBY('id','desc')->get();
---
select * from `coupon` order by `id` desc