calander/crm/admin/app/Modules/Orders/OrderRepository.php

    public function getSearchedPaginated($searchData, $items = 10, $orderBy = 'inventory_id', $orderType = 'ASC')
    {
        $model = $this->model->forMe()->ordered()
            ->with('items', 'creator.parent')
            ->where(function ($query) use ($searchData) {
                if (@$searchData['oid'] != '') {
                    $query->where('OID', 'LIKE', $searchData['oid']);
                }

                if (@$searchData['date_from'] != '') {
                    $query->whereRaw("DATE(created_at) >= '" . \DateTime::createFromFormat('d/m/Y', urldecode($searchData['date_from']))->format("Y-m-d") . "'");
                }

                if (@$searchData['date_to'] != '') {
                    $query->whereRaw("DATE(created_at) <= '" . \DateTime::createFromFormat('d/m/Y', urldecode($searchData['date_to']))->format("Y-m-d") . "'");
                }

                if (@$searchData['status'] != '') {
                    $query->where('status', '=', $searchData['status']);
                }

                if (@$searchData['user_id'] != '') {
                    $query->where('created_by', '=', $searchData['user_id']);
---
select * from `orders` where `status` = '2' order by `created_at` desc