calander/crm/admin/app/Modules/Invoices/InvoiceRepository.php

    public function getPaginated($items = 10, $invoiceBy = 'created_at', $invoiceType = 'DESC', $unpaid=0)
    {
        //return $this->model->forMe()->with('order')->orderBy($invoiceBy, $invoiceType)->paginate($items);

        $model = $this->model->forMe()->with('order')->orderBy($invoiceBy, $invoiceType);
        if($unpaid==1){
               return $model->get();
           }
        return is_null($items) ? $model->get() : $model->paginate($items);
---
select * from `orders` where `orders`.`id` in ('1982', '1980', '1957', '1943', '1851', '1940', '1768', '1789', '1824', '1798')